ryanplusplus/samd09-tiny/src/start.c
/**
 * \file
 *
 * \brief gcc starttup file for SAMD09
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#include "samd09.h"

/* Initialize segments */
extern uint32_t _sfixed;
extern uint32_t _efixed;
extern uint32_t _etext;
extern uint32_t _srelocate;
extern uint32_t _erelocate;
extern uint32_t _szero;
extern uint32_t _ezero;
extern uint32_t _sstack;
extern uint32_t _estack;

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
int main(void);
/** \endcond */

void __libc_init_array(void);

/* Default empty handler */
void Dummy_Handler(void);

/* Cortex-M0+ core handlers */
void NMI_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void HardFault_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SVC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void PendSV_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SysTick_Handler(void) __attribute__((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void PM_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SYSCTRL_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void WDT_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void RTC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void EIC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void NVMCTRL_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void DMAC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
#ifdef ID_USB
void USB_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
#endif
void EVSYS_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM0_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void SERCOM1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
#ifdef ID_SERCOM2
void SERCOM2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
#endif
void TC1_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void TC2_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
void ADC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
#ifdef ID_DAC
void DAC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));
#endif
void PTC_Handler(void) __attribute__((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__((section(".vectors")))
const DeviceVectors exception_table = {
  /* Configure Initial Stack Pointer, using linker-generated symbols */
  (void*)(uintptr_t)(&_estack),

  (void*)(uintptr_t)Reset_Handler,
  (void*)(uintptr_t)NMI_Handler,
  (void*)(uintptr_t)HardFault_Handler,
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)SVC_Handler,
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)PendSV_Handler,
  (void*)(uintptr_t)SysTick_Handler,

  /* Configurable interrupts */
  (void*)(uintptr_t)PM_Handler, /*  0 Power Manager */
  (void*)(uintptr_t)SYSCTRL_Handler, /*  1 System Control */
  (void*)(uintptr_t)WDT_Handler, /*  2 Watchdog Timer */
  (void*)(uintptr_t)RTC_Handler, /*  3 Real-Time Counter */
  (void*)(uintptr_t)EIC_Handler, /*  4 External Interrupt Controller */
  (void*)(uintptr_t)NVMCTRL_Handler, /*  5 Non-Volatile Memory Controller */
  (void*)(uintptr_t)DMAC_Handler, /*  6 Direct Memory Access Controller */
#ifdef ID_USB
  (void*)(uintptr_t)USB_Handler, /*  7 Universal Serial Bus */
#else
  (void*)(uintptr_t)(0UL), /* Reserved */
#endif
  (void*)(uintptr_t)EVSYS_Handler, /*  8 Event System Interface */
  (void*)(uintptr_t)SERCOM0_Handler, /*  9 Serial Communication Interface 0 */
  (void*)(uintptr_t)SERCOM1_Handler, /* 10 Serial Communication Interface 1 */
#ifdef ID_SERCOM2
  (void*)(uintptr_t)SERCOM2_Handler, /* 11 Serial Communication Interface 2 */
#else
  (void*)(uintptr_t)(0UL), /* Reserved */
#endif
  (void*)(uintptr_t)(0UL), /* Reserved */
  (void*)(uintptr_t)TC1_Handler, /* 13 Basic Timer Counter 0 */
  (void*)(uintptr_t)TC2_Handler, /* 14 Basic Timer Counter 1 */
  (void*)(uintptr_t)ADC_Handler, /* 15 Analog Digital Converter */
  (void*)(uintptr_t)(0UL), /* Reserved */
#ifdef ID_DAC
  (void*)(uintptr_t)DAC_Handler, /* 17 Digital Analog Converter */
#else
  (void*)(uintptr_t)(0UL), /* Reserved */
#endif
  (void*)(uintptr_t)PTC_Handler /* 18 Peripheral Touch Controller */
};

/**
 * \brief This is the code that gets called on processor reset.
 * To initialize the device, and call the main() routine.
 */
void Reset_Handler(void)
{
  uint32_t *pSrc, *pDest;

  /* Initialize the relocate segment */
  pSrc = &_etext;
  pDest = &_srelocate;

  if(pSrc != pDest) {
    for(; pDest < &_erelocate;) {
      *pDest++ = *pSrc++;
    }
  }

  /* Clear the zero segment */
  for(pDest = &_szero; pDest < &_ezero;) {
    *pDest++ = 0;
  }

  /* Set the vector table base address */
  pSrc = (uint32_t*)&_sfixed;
  SCB->VTOR = ((uint32_t)pSrc & SCB_VTOR_TBLOFF_Msk);

  /* Change default QOS values to have the best performance and correct USB behaviour */
  SBMATRIX->SFR[SBMATRIX_SLAVE_HMCRAMC0].reg = 2;
#if defined(ID_USB)
  USB->DEVICE.QOSCTRL.bit.CQOS = 2;
  USB->DEVICE.QOSCTRL.bit.DQOS = 2;
#endif
  DMAC->QOSCTRL.bit.DQOS = 2;
  DMAC->QOSCTRL.bit.FQOS = 2;
  DMAC->QOSCTRL.bit.WRBQOS = 2;

  /* Overwriting the default value of the NVMCTRL.CTRLB.MANW bit (errata reference 13134) */
  NVMCTRL->CTRLB.bit.MANW = 1;

  /* Initialize the C library */
  __libc_init_array();

  /* Branch to main function */
  main();

  /* Infinite loop */
  while(1)
    ;
}

/**
 * \brief Default interrupt handler for unused IRQs.
 */
void Dummy_Handler(void)
{
  while(1) {
  }
}
